burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Include/gd32w51x_f5hc_fmc.h
/*!
    \file    gd32w51x_f5hc_fmc.h
    \brief   definitions for the FMC

    \version 2026-04-15, V2.0.0, firmware for gd32w51x_f5hc
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#ifndef gd32w51x_f5hc_FMC_H
#define gd32w51x_f5hc_FMC_H

#include "gd32w51x_f5hc.h"

/* FMC and option bytes definition */
#define FMC                             FMC_BASE                                         /*!< FMC base address */

/* registers definitions */
/* non-secure registers */
#define FMC_KEY                         REG32(FMC + 0x00000004U)                         /*!< FMC unlock key register */
#define FMC_OBKEY                       REG32(FMC + 0x00000008U)                         /*!< FMC option bytes unlock key register */
#define FMC_STAT                        REG32(FMC + 0x0000000CU)                         /*!< FMC status register */
#define FMC_CTL                         REG32(FMC + 0x00000010U)                         /*!< FMC control register */
#define FMC_ADDR                        REG32(FMC + 0x00000014U)                         /*!< FMC address register */
#define FMC_OBSTAT                      REG32(FMC + 0x0000001CU)                         /*!< FMC option bytes status register */
/* secure registers */
#define FMC_SECKEY                      REG32(FMC + 0x00000024U)                         /*!< FMC secure unlock key register */
#define FMC_SECSTAT                     REG32(FMC + 0x0000002CU)                         /*!< FMC secure status register */
#define FMC_SECCTL                      REG32(FMC + 0x00000030U)                         /*!< FMC secure control register */
#define FMC_SECADDR                     REG32(FMC + 0x00000034U)                         /*!< FMC secure address register */
/* non-secure registers */
#define FMC_OBR                         REG32(FMC + 0x00000040U)                         /*!< FMC option byte register */
#define FMC_OBUSER                      REG32(FMC + 0x00000044U)                         /*!< FMC option byte user register */
/* secure registers */
#define FMC_SECMCFG0                    REG32(FMC + 0x00000048U)                         /*!< FMC secure mark configuration register 0 */
#define FMC_DMP0                        REG32(FMC + 0x0000004CU)                         /*!< FMC secure dedicated mark protection register 0*/
/* non-secure register */
#define FMC_OBWRP0                      REG32(FMC + 0x00000050U)                         /*!< FMC option byte write protection area register 0 */
#define FMC_SECMCFG1                    REG32(FMC + 0x00000054U)                         /*!< FMC secure mark configuration register 1 */
#define FMC_DMP1                        REG32(FMC + 0x00000058U)                         /*!< FMC secure dedicated mark protection register 1 */
/* non-secure register */
#define FMC_OBWRP1                      REG32(FMC + 0x0000005CU)                         /*!< FMC option byte write protection area register 1 */
/* non-secure register */
#define FMC_SECMCFG2                    REG32(FMC + 0x00000060U)                         /*!< FMC secure mark configuration register 2 */
#define FMC_SECMCFG3                    REG32(FMC + 0x00000064U)                         /*!< FMC secure mark configuration register 3 */
#if defined(GD32F5HC)
#define FMC_OBR1                        REG32(FMC + 0x00000068U)                         /*!< FMC option byte register 1 */
#endif /* defined(GD32F5HC) */
/* secure registers when TZEN = 1 */
#define FMC_NODEC0                      REG32(FMC + 0x00000070U)                         /*!< FMC NO-RTDEC region register 0 */
#define FMC_NODEC1                      REG32(FMC + 0x00000074U)                         /*!< FMC NO-RTDEC region register 1 */
#define FMC_NODEC2                      REG32(FMC + 0x00000078U)                         /*!< FMC NO-RTDEC region register 2 */
#define FMC_NODEC3                      REG32(FMC + 0x0000007CU)                         /*!< FMC NO-RTDEC region register 3 */
#define FMC_OFRG                        REG32(FMC + 0x00000080U)                         /*!< FMC offset region register */
#define FMC_OFVR                        REG32(FMC + 0x00000084U)                         /*!< FMC offset value register */
/* secure registers */
#define FMC_DMPCTL                      REG32(FMC + 0x0000008CU)                         /*!< FMC DMP control register */
/* when TZEN = 1, this register can be read by secure and non-secure access and it is write-protected against non-secure write access when the flash is secure */
#define FMC_PRIVCFG                     REG32(FMC + 0x00000090U)                         /*!< FMC privilege configuration register */
/* non-secure register */
#define FMC_PID                         REG32(FMC + 0x00000100U)                         /*!< FMC product ID register */

