burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Include/gd32w51x_f5hc_fmc.h
/* secure mark configuration register x(x=0,1,2,3) */
#define SECM_INDEX0                     ((uint32_t)0x00000000U)                          /*!< FMC_SECMCFG0 register index */
#define SECM_INDEX1                     ((uint32_t)0x00000001U)                          /*!< FMC_SECMCFG1 register index */
#define SECM_INDEX2                     ((uint32_t)0x00000002U)                          /*!< FMC_SECMCFG2 register index */
#define SECM_INDEX3                     ((uint32_t)0x00000003U)                          /*!< FMC_SECMCFG3 register index */

/* DMP mark configuration register x(x=0,1) */
#define DMP_INDEX0                      ((uint32_t)0x00000000U)                          /*!< FMC_DMP0 register index */
#define DMP_INDEX1                      ((uint32_t)0x00000001U)                          /*!< FMC_DMP1 register index */

/* NO RTDEC configuration register x(x=0,1,2,3) */
#define NODEC_INDEX0                    ((uint32_t)0x00000000U)                          /*!< FMC_NODEC0 register index */
#define NODEC_INDEX1                    ((uint32_t)0x00000001U)                          /*!< FMC_NODEC1 register index */
#define NODEC_INDEX2                    ((uint32_t)0x00000002U)                          /*!< FMC_NODEC2 register index */
#define NODEC_INDEX3                    ((uint32_t)0x00000003U)                          /*!< FMC_NODEC3 register index */

#if defined(GD32F5HC)
/* option byte software/hardware free watch dog timer */
#define OB_FWDGT_HW                    ((uint32_t)0x00000000U)                           /*!< hardware free watchdog */
#define OB_FWDGT_SW                    FMC_OBR1_NWDG_HW                                  /*!< software free watchdog */

/* FWDGT suspend option in deepsleep mode configuration bit */
#define OB_DEEPSLEEP_SUSPEND           ((uint32_t)0x00000000U)                           /*!< FWDGT is suspend in system deepsleep mode */
#define OB_DEEPSLEEP_RUN               FMC_OBR1_FWDGSPD_DPSLP                            /*!< FWDGT is running in system deepsleep mode */

/* FWDGT suspend option in standby mode configuration bit */
#define OB_STDBY_SUSPEND               ((uint32_t)0x00000000U)                           /*!< FWDGT is suspend in system standby mode */
#define OB_STDBY_RUN                   FMC_OBR1_FWDGSPD_STDBY                            /*!< FWDGT is running in system standby mode */

/* SWBOOT0 option bits */
#define OB_BOOT0_NBOOT0                ((uint32_t)0x00000000U)                           /*!< Select nBOOT0 as BOOT0 signal */
#define OB_BOOT0_PC8                   FMC_OBR1_NSWBOOT0                                 /*!< Select PC8 pin as BOOT0 signal */

/* BOOT0 option bits */
#define OB_BOOT0_1                     ((uint32_t)0x00000000U)                           /*!< BOOT0 is 1 */
#define OB_BOOT0_0                     FMC_OBR1_NBOOT0                                   /*!< BOOT0 is 0 */

/* SWBOOT1 option bits */
#define OB_BOOT1_NBOOT1                ((uint32_t)0x00000000U)                           /*!< Select nBOOT1 as BOOT1 signal */
#define OB_BOOT1_PA14                  FMC_OBR1_SWBOOT1                                  /*!< Select PA14 pin as BOOT1 signal */

/* BOOT1 option bits */
#define OB_BOOT1_1                     ((uint32_t)0x00000000U)                           /*!< BOOT1 is 1 */
#define OB_BOOT1_0                     FMC_OBR1_NBOOT1                                   /*!< BOOT1 is 0 */
#endif /* defined(GD32F5HC) */

/* FMC flags */
#define OB_FLAG_NSPC                    ((uint32_t)0x00000000U)                          /*!< flash security protection level 0 state */
#define OB_FLAG_SPC1                    FMC_OBSTAT_SPC                                   /*!< flash security protection level 0.5 state */
#define OB_FLAG_SPC0_5                  FMC_OBSTAT_SPC_P5                                /*!< flash security protection level 1 state */

/* FMC interrupt enable */
#if defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3)
#define FMC_INT_ERR                     FMC_SECCTL_SECERRIE                              /*!< FMC secure error interrupt enable */
#define FMC_INT_END                     FMC_SECCTL_SECENDIE                              /*!< FMC secure end of operation interrupt enable */
#else
#define FMC_INT_ERR                     FMC_CTL_ERRIE                                    /*!< FMC error interrupt enable */
#define FMC_INT_END                     FMC_CTL_ENDIE                                    /*!< FMC end of operation interrupt enable */
#endif /* defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3) */

/* FMC flags */
#if defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3)
#define FMC_FLAG_BUSY                   FMC_SECSTAT_SECBUSY                              /*!< FMC busy flag */
#define FMC_FLAG_SECERR                 FMC_SECSTAT_SECERR                               /*!< FMC secure error flag */
#define FMC_FLAG_WPERR                  FMC_SECSTAT_SECWPERR                             /*!< FMC secure erase/program protection error flag */
#define FMC_FLAG_END                    FMC_SECSTAT_SECENDF                              /*!< FMC secure end of operation flag */
#else
#define FMC_FLAG_BUSY                   FMC_STAT_BUSY                                    /*!< FMC busy flag */
#define FMC_FLAG_WPERR                  FMC_STAT_WPERR                                   /*!< FMC erase/program protection error flag */
#define FMC_FLAG_END                    FMC_STAT_ENDF                                    /*!< FMC end of operation flag */
#endif /* defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3) */
#define FMC_FLAG_OBERR                  FMC_STAT_OBERR                                   /*!< option bytes error flag */

/* FMC interrupt flags */
#if defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3)
#define FMC_INT_FLAG_SECERR             FMC_SECSTAT_SECERR                               /*!< FMC secure error interrupt flag */
#define FMC_INT_FLAG_WPERR              FMC_SECSTAT_SECWPERR                             /*!< FMC secure erase/program protection error interrupt flag */
#define FMC_INT_FLAG_END                FMC_SECSTAT_SECENDF                              /*!< FMC secure end of operation interrupt flag */
#else
#define FMC_INT_FLAG_WPERR              FMC_STAT_WPERR                                   /*!< FMC erase/program protection error interrupt flag */
#define FMC_INT_FLAG_END                FMC_STAT_ENDF                                    /*!< FMC end of operation interrupt flag */
#endif /* defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3) */

/* FMC timeout */
#define FMC_TIMEOUT_COUNT              ((uint32_t)0xFFFFFFFFU)                           /*!< FMC timeout count value */

/* FMC BANK address */
#define FLASH_SIZE                     ((uint32_t)0x200000U)                        /*!< flash max size */
#if defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3)
#define FLASH_BASE_ADDRESS             ((uint32_t)0x0C000000U)                      /*!< flash base address */
#define FLASH_END_ADDRESS              ((uint32_t)0x0C200000U)                      /*!< flash end address */
#else
#define FLASH_BASE_ADDRESS             ((uint32_t)0x08000000U)                      /*!< flash base address */
#define FLASH_END_ADDRESS              ((uint32_t)0x08200000U)                      /*!< flash end address */
#endif

