burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Include/gd32w51x_f5hc_fmc.h
/* parameter check definitions */
#ifdef FW_DEBUG_ERR_REPORT
/* check FMC page valid address */
#define NOT_FMC_PAGE_VALID_ADDRESS(page_address)      (((page_address) >= FLASH_END_ADDRESS) || ((page_address) < FLASH_BASE_ADDRESS))
/* check FMC flash valid word address */
#define NOT_FMC_FLASH_WORD_ADDRESS(address)           (((address) >= FLASH_END_ADDRESS) || ((address) < FLASH_BASE_ADDRESS) || (0U != ((address) & 0x3U)))
#endif /* FW_DEBUG_ERR_REPORT */


/* function declarations */
/* FMC main memory programming functions */
/* unlock the main FMC operation */
void fmc_unlock(void);
/* lock the main FMC operation */
void fmc_lock(void);
/* FMC erase page */
fmc_state_enum fmc_page_erase(uint32_t page_address);
/* FMC erase whole chip */
fmc_state_enum fmc_mass_erase(void);
/* FMC program a word at the corresponding address */
fmc_state_enum fmc_word_program(uint32_t address, uint32_t data);
/* FMC program continuously at the corresponding address */
fmc_state_enum fmc_continuous_program(uint32_t address, uint32_t data[], uint32_t size);

/* enable SRAM1 reset automatically function */
void sram1_reset_enable(void);
/* disable SRAM1 reset automatically function */
void sram1_reset_disable(void);
/* enable the privileged access */
void fmc_privilege_enable(void);
/* disable the privileged access */
void fmc_privilege_disable(void);

/* FMC option bytes programming functions */
/* unlock the option bytes operation */
void ob_unlock(void);
/* lock the option bytes operation */
void ob_lock(void);

/* send option bytes modification start command */
void ob_start(void);
/* reload option bytes */
void ob_reload(void);
/* configure the option bytes security protection */
fmc_state_enum ob_security_protection_config(uint8_t ob_spc);

#if defined (GD32F5HC)
/* configure the option byte for fwdgt/deepsleep/standby */
void ob_wdgt_config(uint32_t ob_fwdgt, uint32_t ob_deepsleep, uint32_t ob_stdby);
/* configure the option byte for boot0/boot1 */
void ob_boot_config(uint32_t swboot0, uint32_t boot0, uint32_t swboot1, uint32_t boot1);
#endif /* defined (GD32F5HC) */

/* enable trustzone */
fmc_state_enum ob_trustzone_enable(void);
/* disable trustzone */
ErrStatus ob_trustzone_disable(void);
/* program option bytes USER */
fmc_state_enum ob_user_write(uint16_t ob_user);
/* configure write protection pages */
fmc_state_enum ob_write_protection_config(uint32_t wrp_spage, uint32_t wrp_epage, uint32_t wrp_register_index);
/* configure secure mark pages */
void ob_secmark_config(uint32_t secm_spage, uint32_t secm_epage, uint32_t secm_register_index);
#if defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3)
/* enable DMP region access right */
void ob_dmp_access_enable(uint32_t dmp_register_index);
/* disable DMP region access right */
void ob_dmp_access_disable(uint32_t dmp_register_index);
#endif /* defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3) */
/* configure DMP secure pages */
ErrStatus ob_dmp_config(uint32_t dmp_epage, uint32_t dmp_register_index);
/* enable DMP function */
fmc_state_enum ob_dmp_enable(uint32_t dmp_register_index);
/* disable DMP function */
fmc_state_enum ob_dmp_disable(uint32_t dmp_register_index);
/* configure NO-RTDEC pages */
void fmc_no_rtdec_config(uint32_t nodec_spage, uint32_t nodec_epage, uint32_t nodec_register_index);

/* FMC read offset function */
/* configure offset region */
void fmc_offset_region_config(uint32_t of_spage, uint32_t of_epage);
/* configure offset value */
void fmc_offset_value_config(uint32_t of_value);

/* get option bytes write protection state, only applies to get the status of write/erase protection setting by EFUSE */
FlagStatus ob_write_protection_get(void);
/* get the value of option bytes USER */
uint16_t ob_user_get(void);

/* get option bytes security protection state */
FlagStatus ob_security_protection_flag_get(uint32_t spc_state);
/* get trustzone state */
FlagStatus ob_trustzone_state_get(void);

/* get the state of whether the option byte exist or not */
FlagStatus ob_exist_state_get(void);

/* FMC interrupts and flags management functions */
/* get FMC flag status */
FlagStatus fmc_flag_get(uint32_t flag);
/* clear the FMC flag */
void fmc_flag_clear(uint32_t flag);
/* enable FMC interrupt */
void fmc_interrupt_enable(uint32_t interrupt);
/* disable FMC interrupt */
void fmc_interrupt_disable(uint32_t interrupt);
/* get FMC interrupt flag */
FlagStatus fmc_interrupt_flag_get(uint32_t flag);
/* clear FMC interrupt flag */
void fmc_interrupt_flag_clear(uint32_t flag);
/* check whether FMC is ready or not */
fmc_state_enum fmc_ready_wait(uint32_t timeout);

#endif /* gd32w51x_f5hc_FMC_H */
